{
  "Steve": "Steve has over 20 years of experience in investment banking, consulting, listed company executive and entrepreneurship. Steve was Founder and Chairman of Doing Technology, a leading technology solution provider in China for intelligent cities and transportation. Prior to that, Steve was CEO of Canoo China and the Board Director of Canoo (NASDAQ: GOEV), a mobility technology company, designs, engineers and manufactures electric vehicles with a multi-purpose platform architecture using self-contained, fully functional rolling chassis design. Before Canoo, Steve was General Manager of JPMorgan covering 13 provinces across West China. Steve joined JPMorgan’s Investment Banking Division in New York in 2008 and was expatriated to China in 2012. Steve also served as Director at Tenneco, a Fortune 200 company in engineering and manufacturing automotive products, while leading acquisitions of Chinese automotive suppliers. Steve started career as Management Consultant at IBM for 5 years covering automotive, airline and health care sectors.\n\nSteve holds an MBA from the Columbia Business School; an EMBA from Tsinghua University PBCSF; and a BA from Dongbei University of Finance and Economics.",
  "Bill": "Bill has over 11 years of experience in private equity and cross border investing. Before Veritas Partners Asia, from 2016 to 2023, Bill was a core deal captain of consumer private equity team of Hillhouse Capital, a global private equity firm deeply rooted in China and one of Asia’s largest alternative investment managers with AUM of over US$70bn. Bill has deep vertical knowledge in the consumer, TMT and manufacturing sectors and has led growth capital and buyout transactions worth over US$2billion. Prior to Hillhouse Capital, Bill spent 3 years at China-ASEAN Investment Cooperation Fund focusing on natural resources, energy, agriculture and infrastructure sectors in China and Southeast Asia. Bill also spent time with Warburg Pincus in New York and Sanford Bernstein in Hong Kong. Bill started career at E&Y in Hong Kong.\n\nBill holds an MBA from the Columbia Business School; a MS from the Simon Business School of the University of Rochester; and a BBA from the Hong Kong Polytechnic University. ",
  "Zhen": "Zhen has around 10 years of experience in private equity and capital markets. Before Veritas Partners Asia, Zhen served key role at CDH Investments, Hillhouse Capital and Hitone Capital. Zhen has deep knowledge and strong connection in consumer, real estate and sports sectors and have completed transactions worth over US$500 million. Zhen is highly resourceful in media, branding and PR space and previously served as PR advisor to a listed healthcare company with market value over US$10 billion.\n\nZhen holds an MBA from the Columbia Business School and a BS from the Renmin University of China.",
  "Locke": "Locke has over 15 years of experience in private equity, transaction service and accounting. Before Veritas Partners Asia, Locke held senior roles at China-ASEAN Investment Cooperation Fund, PwC and KPMG. Locke is highly knowledgeable in consumer and TMT sectors, and sophisticated in corporate branding and marketing, IPO preparation, M&A transactions and CSR/ESG spaces. Locke previously served as operations and financial management, accounting and transaction service advisor to multiple large-cap corporations.\n\nLocke is a practicing Certified Public Accountant in Hong Kong and an ICAEW Chartered Accountant in England and Wales. Locke is also an EFFAS Certified ESG Analyst\n\nLocke holds BSc and MBA from the Hong Kong University of Science and Technology.",
  "Jaekwang": "A Korean citizen as well as a “Beijing native”, Jaekwang has over 15 years of cross-border business development and investing. Jaekwang is Chief Operating Officer of Phoenix Bridge International Holdings Group Investment Company (PBIH), a diversified investment holding group with investments in infrastructure, natural resources, health care, technology, education, and real properties worldwide. Before PBIH, Jaekwang was Deputy Representative for the China Branch of the Korea-China Cultural Foundation providing advisory service to the entertainment industry and Sino-Korean National Fund. Prior to that, Jaekwang was at APPDISCO, Korea's largest mobile advertising platform, sourcing investments in China and overseeing service launches. Jaekwang founded and subsequently exited a digital information kiosk business ESI in the Shanghai Hongqiao Transportation Hub. Jaekwang started career at KT Global’s Investment Department in Korea.\nJaekwang holds an LLB and an MJC from Peking University.",
  "Hongling": "Ms. Xie is a senior press and media executive in the urban development, real estate and cultural tourism space. Ms.Xie was founder and editor-in-chief of House China, China’s most influential and professional news and media platform for the real estate industry. Ms. Xie also established House China Annual Forum and made it the most impactful annual event in the real estate industry for 10 consecutive years. Ms. Xie served as PR advisor for a number oflarge corporates including River Star,BeijingCapital Land, Longfor, CITIC Real Estate. Since 2019, Ms. Xu ventured beyond real estate industry and serve as PR and media advisor to listed companies such as Innovita, providing strategic support in regarding PR and GR management, pre-IPO and post-IPO press and media strategy etc.\nMs. Xie holds BA from Capital Normal University."
}
